Repository: hlmDev/muqlla
Catalog: muqlla/Localizable.xcstrings
Source language: en
Languages: ar

source: Explore the legacy of Alfred Marshall, a pioneer of the neoclassical school of economics. This book highlights his groundbreaking ideas on utility, supply, and demand, as well as his efforts to make economics accessible. Marshall’s work shaped modern economic thought, emphasizing individual behavior and its influence on production, costs, and market value. A must-read for understanding the foundations of contemporary economics.
ar: استكشف إرث ألفريد مارشال، رائد المدرسة النيوكلاسيكية في علم الاقتصاد. يسلط هذا الكتاب الضوء على أفكاره الرائدة حول المنفعة والعرض والطلب، بالإضافة إلى جهوده لجعل علم الاقتصاد أكثر سهولة واستيعابًا. ساهمت أعمال مارشال في تشكيل الفكر الاقتصادي الحديث، حيث ركزت على السلوك الفردي وتأثيره على الإنتاج والتكاليف وقيمة السوق. قراءة لا غنى عنها لفهم أسس علم الاقتصاد المعاصر.

source: 10.7K Readers
ar: ١٠.٧ الآف قارى

source: Add a title first
ar: أضف العنوان أولاً

source: Alanoud Alsamil
ar: العنود الصامل

source: All
ar: الكل

source: App logo An artistic drawing of an eye with a pencil
ar: شعار التطبيق قلم يرسم عين

source: Author
ar: المؤلف

source: Author:
ar: المؤلف

source: Author: %@
ar: الكاتب

source: Back
ar: رجوع

source: Book content
ar: محتوى الكتاب

source: Book Date
ar: تاريخ الإنشاء

source: Book Description
ar: ملخص الكتاب

source: Book Image
ar: غلاف الكتاب

source: Book Name
ar: عنوان الكتاب

source: Book title
ar: عنوان الكتاب

source: by
ar: بواسطة

source: By %@
ar: تأليف: العنود الصامل

source: Cancel
ar: الغاء

source: Cancel writing
ar: إلغاء الكتابة

source: CATEGORY
ar: التصنيف

source: Co-authors:
ar: المؤلفون المشاركون

source: Co-write books with authors worldwide Discover unique books born from collaboration.
ar: شارك في كتابة الكتب مع مؤلفين من جميع أنحاء العالم اكتشف كتبًا فريدة وُلدت من روح التعاون.

source: Co-write books with authors worldwide\nDiscover unique books born from collaboration.
ar: شارك في كتابة الكتب مع مؤلفين من جميع أنحاء العالم اكتشف كتبًا فريدة وُلدت من روح التعاون.

source: Collabs
ar: تعاون

source: Complete
ar: مكتمل

source: Creation date
ar: تاريخ الإنشاء

source: Delete
ar: حذف

source: Dismiss error
ar: خطأ

source: Double tap to close this error message
ar: اضغط مرتين لإغلاق النافذه

source: Double tap to publish your book
ar: إنشر كتابك

source: Double tap to sign in using your Apple ID. This will request access to your name and email
ar: اضغط مرتين لتسجيل علي ابل اي دي

source: Double tap to skip the introduction and proceed to the main app
ar: اضغط مرتين لتخطي

source: Drafts
ar: مسودة

source: Edit
ar: تعديل

source: English
ar: الإنجليزية

source: Enter text to search for books
ar: اضغط للبحث عن كتاب

source: Enter the title of your book
ar: أدخل عنوان الكتاب

source: Error
ar: خطأ

source: Home
ar: الصفحة الرئيسية

source: Incomplete
ar: غير مكتمل

source: LANGUAGE
ar: اللغة

source: No books found
ar: لا يوجد كتب متاحة

source: OK
ar: حسنا

source: PAGES
ar: الصفحات

source: PARTS
ar: الاجزاء

source: Profile
ar: الصفحة الشخصية

source: Publish
ar: إنشر كتابك

source: Publish book
ar: نشر الكتاب

source: Pycology
ar: علم النفس

source: Reem, Shahad, Ahlam
ar: ريم ، شهد ، احلام

source: RELEASED
ar: الإصدار

source: Save to Draft
ar: حفظ في المسودات

source: Search
ar: بحث

source: Search books
ar: بحث عن الكتاب

source: Select
ar: تحديد

source: Skip
ar: تخطي

source: Start New Chapter
ar: ابدأ فصلًا جديدًا

source: Start Reading
ar: ابدآ القراءة

source: Step into a world of endless stories
ar: ادخل إلى عالم من القصص التي لا تنتهي

source: Title
ar: العنوان

source: Type your Book..
ar: أكتب كتابك

source: View all books
ar: مشاهدة جميع الكتب

source: View your profile information
ar: مشاهدة معلومات الكتاب

source: Wish I Were My Alter Ego
ar: ليتني كنت ذاتي الأخرى

source: Write
ar: أكتب

source: Write your book content here
ar: أكتب محتوى كتابك هنا
